Revit 2027 API
ParameterTypeId.UserTopConstraint Property
 "Top Constraint"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId UserTopConstraint { get; }
Public Shared ReadOnly Property UserTopConstraint As ForgeTypeId
	Get
public:
static property ForgeTypeId^ UserTopConstraint {
	ForgeTypeId^ get ();
}
static member UserTopConstraint : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace